{"cover":"kryxivia_cover_first-post-on-the-kryxivia-devblog.jpg","category":"2","date":1640042260,"lang":{"en":{"title":"First post on the Kryxivia Devblog!","desc":"#1 | First post on the Kryxivia devblog, check out our latest advancements and our artists works!","content":{"1":{"type":"title","c":"Introduction"},"2":{"type":"txt","c":"Hey everyone, welcome to the first devblog article of the Kryxivia team, we will use it to show you the progress of the game and our struggling points on the game development due to his unique crypto aspects and the complexity of handling a whole network protocol for an MMORPG, especially based on the WebGL technology (playable on the browser).\n\nTo start our brainstorming and design we first make mocks-up, decide, update and then move to a 3D environment to make happen the magic!"},"3":{"type":"img","c":"kryxivia_first-post-on-the-kryxivia-devblog_base-figure-of-the-male-kryxivia-character.jpg","a":"Base figure of the male Kryxivia character"},"4":{"type":"txt","c":"Lately, we started a rebranding of our male and female characters, we made multiple versions before being quite satisfied with the results:"},"5":{"type":"img","c":"kryxivia_first-post-on-the-kryxivia-devblog_first-representation-in-3d-for-the-kryxivia-male-first-version.jpg","a":"First representation in 3D for the Kryxivia male, first version"},"6":{"type":"txt","c":"Since we are playable on a browser, it means that we need low-polygon models to avoid low-FPS or GPU issues for players: it adds a point of complexity where we trying to combine a good looking, fun, and appealing character and the optimization process for stable gameplay."},"7":{"type":"img","c":"kryxivia_first-post-on-the-kryxivia-devblog_reworked-version-of-the-male-character-in-kryxivia.png","a":"Reworked version of the male character in Kryxivia"},"8":{"type":"img","c":"kryxivia_first-post-on-the-kryxivia-devblog_female-character-of-the-kryxivia-world.png","a":"Female character of the Kryxivia World"},"9":{"type":"title","c":"In-game PVE"},"10":{"type":"txt","c":"For the alpha release, we do work on multiple dungeons\/bosses to have a smooth game experience mixing cool animations, difficulty, and good NFT rewards. For example, this is an old civilization with long-forgotten ruin.\n\nWe work on a story first for a new zone, by creating the concept art and moving on to the creation of the 3d level design environment, and then the boss that will live inside it.\n\nThe boss here is the guardian of the entrance of \"a big underground city\" it's a 3 legged mechanical spider robot powered by magic crystals, with apparent wear from ages of work.\n\nHere is a mood board that we created to think about the civilization design and 3D environment: <a href=\"https:\/\/docs.google.com\/presentation\/d\/1Az1n6N-52jPvOKppE31E9HlmPhca2I-rUf8ZmxfJIqA\/edit#slide=id.g1044ce2ccd5_0_14\" rel=\"noopener noreferrer\" target=\"_blank\">Here<\/a>"},"11":{"type":"img","c":"kryxivia_first-post-on-the-kryxivia-devblog_civilization-dungeon-1-first-look-on-the-environment.png","a":"Civilization dungeon #1 - first look on the environment"},"12":{"type":"img","c":"kryxivia_first-post-on-the-kryxivia-devblog_civilization-dungeon-2-second-twist-on-the-environment.png","a":"Civilization dungeon #2 - second twist on the environment"},"13":{"type":"txt","c":"Our game studio partners N-Hance help us on bringing our ideas to the Kryxivia world, we send them specific details on the boss design and animations:"},"14":{"type":"img","c":"kryxivia_first-post-on-the-kryxivia-devblog_first-mock-up-of-the-boss-in-the-civilization-dungeon.jpg","a":"First Mock-up of the boss in the civilization dungeon"},"15":{"type":"img","c":"kryxivia_first-post-on-the-kryxivia-devblog_with-the-differents-animations-of-the-boss-design.jpg","a":"With the differents animations of the boss design"},"16":{"type":"txt","c":"For a final version of:"},"17":{"type":"img","c":"kryxivia_first-post-on-the-kryxivia-devblog_final-version-of-the-kryxivia-ancient-civilization-boss.png","a":"Final version of the Kryxivia ancient civilization boss"},"18":{"type":"txt","c":"Once we have the boss concept and 3D design, we create the gameplay linked to it and the animations:\nAs a global rule, the gears of the boss spins faster during anticipation frames\n"},"19":{"type":"sub","c":"MOVEMENT"},"20":{"type":"txt","c":"walk ;\nidle -> small movement up and down;\njump start -> the boss crouch to prepare for the jump and then leaps into the air;\njump loop -> the boss is in a jumping loop;\njump land -> the boss land on the ground unbalanced and raise to his idle state;"},"21":{"type":"sub","c":"ATTACKS"},"22":{"type":"txt","c":"ground slam -> the boss raise up and slam the ground with his bottom;\ncast start -> the boss's gear start spinning fast and reveal the crystal on top of the boss;\ncast loop -> the boss does small shaky movement;\ncast end -> the boss top hatche closes and goes back to idle;"},"23":{"type":"sub","c":"CONTEXTUAL"},"24":{"type":"txt","c":"During the boss fight, the boss will have two ways of recharging his energy,\none is by putting the pin on his legs into a wall socket; this occurs when he is fully functional\nand the other one is by engaging one of his gears into gear in the wall; this happen when he already took a lot of damage"},"25":{"type":"txt","c":"Our main priority at the moment is the in-game content and gameplay to have the alpha ready, we also do some coding network optimization too.\nReview the current list of spells existing at the moment in the Kryxivia universe:\n\n<a href=\"https:\/\/docs.google.com\/spreadsheets\/d\/10i3DEWooGhS0Nair6wk_2swaZNn6dMadTgHbvN7fZaY\/\" rel=\"noopener noreferrer\" target=\"_blank\">Here<\/a>"}}}}}